Repository: Hedgehog734/CrushBot
Catalog: CrushBot.Application/Localization/Resources/Resources.*.resx
Languages: ar, ru

# Button.AskCity.SendLocation
source: Send my location 📍
ar: أرسل موقعي 📍
ru: Отправить текущую 📍

# Button.AskMedia.Photo
source: Photos 📸
ar: صور 📸
ru: Фото 📸

# Button.AskMedia.Video
source: Video 🎬
ar: فيديو 🎬
ru: Видео 🎬

# Button.AskSex.Female
source: Woman 💅
ar: أنثى 💅
ru: Девушка 💅

# Button.AskSex.Male
source: Man 💪
ar: ذكَر 💪
ru: Парень 💪

# Button.AskSexFilter.Any
source: Everyone
ar: الجميع
ru: Всех

# Button.AskSexFilter.Female
source: Women 💅
ar: نساء 💅
ru: Девушек 💅

# Button.AskSexFilter.Male
source: Men 💪
ar: رجال 💪
ru: Парней 💪

# Button.EditFilters.ChangeAge
source: 📅 Change age
ar: 📅 تغيير العمر
ru: 📅 Изменить возраст

# Button.EditFilters.ChangeSex
source: 💪💅 Change gender
ar: 💪💅 تغيير الجنس
ru: 💪💅 Изменить пол

# Button.EditProfile.ChangeAll
source: 👤 Start from scratch
ar: 👤 ابدأ من الصفر
ru: 👤 Заполнить заново

# Button.EditProfile.ChangeCity
source: 🌍 Change city
ar: 🌍 تغيير المدينة
ru: 🌍 Изменить город

# Button.EditProfile.ChangeDescription
source: ✏️ Change description
ar: ✏️ تغيير الوصف
ru: ✏️ Изменить описание

# Button.EditProfile.ChangeMedia
source: 📷🎬 Change media
ar: 📷🎬 تغيير الوسائط
ru: 📷🎬 Изменить медиа

# Button.Profile.Edit
source: 👤 Edit profile
ar: 👤 تعديل الملف الشخصي
ru: 👤 Редактировать профиль

# Button.Profile.Filters
source: 📋 Change filters
ar: 📋 تعديل الفلاتر
ru: 📋 Изменить фильтры

# Button.Profile.Settings
source: ⚙️ Settings
ar: ⚙️ الإعدادات
ru: ⚙️ Настройки

# Button.Profile.ViewMatches
source: 🎉 View matches
ru: 🎉 Взаимные симпатии

# Button.Profile.ViewProfiles
source: 🔍 Start search
ar: 🔎 ابدأ البحث
ru: 🔍 Начать поиск

# Button.Settings.DeleteProfile
source: 🗑️ Delete profile
ar: 🗑️ حذف الملف الشخصي
ru: 🗑️ Удалить профиль

# Button.Settings.HideEmoji
source: Hide emoji
ar: اخفاء الإيموجي
ru: Скрыть эмодзи

# Button.Settings.Language
source: 🌐 Language
ar: 🌐 اللغة
ru: 🌐 Язык

# Button.Settings.ShowEmoji
source: Show emoji
ar: عرض الإيموجي
ru: Показать эмодзи

# Button.Settings.SubscribeMonthly
source: Monthly – {0}€
ar: شهريًا – {0}€
ru: На месяц – {0}€

# Button.Settings.SubscribeYearly
source: Yearly – {0}€ (-{1}%)
ar: سنويًا – {0}€ (-{1}٪)
ru: На год – {0}€ (-{1}%)

# Button.Shared.Back
source: ◀️ Back
ar: ▶️ خلف
ru: ◀️ Назад

# Button.Shared.Continue
source: Continue ▶️
ar: استمر ◀️
ru: Продолжить ▶️

# Button.Shared.Current
source: Keep as is ▶️
ar: أبقي كما هو ◀️
ru: Не изменять ▶️

# Message.AskAge.AskAge
source: How old are you?
ar: كم عمرك؟
ru: Сколько тебе лет?

# Message.AskAgeFilter.AskAgeFilter
source: Enter a number or age with a hyphen\. Allowed range: __{0}\-{1}__\.
ar: أدخل الرقم أو العمر بفاصل شرطة\. النطاق المسموح به: __{0}\-{1}__\.
ru: Введи число или возраст через дефис\. Допустимый диапазон: __{0}\-{1}__\.

# Message.AskAgeFilter.AskAgeFilterSub
source: Enter a number or age with a hyphen\. Allowed range: __{0}\-{1}__\. ||_✨ Subscription range: {2}\-{3}_||
ar: أدخل الرقم أو العمر بفاصل شرطة\. النطاق المسموح به: __{0}\-{1}__\. ||_✨ نطاق الاشتراك: {2}\-{3}_||
ru: Введи число или возраст через дефис\. Допустимый диапазон: __{0}\-{1}__\. ||_✨ C подпиской: {2}\-{3}_||

# Message.AskCity.AskCity
source: Which city? _Type it in, choose geolocation on the map 📎 or send your current 📍_
ar: أي مدينة؟ _اكتبها، اختر الموقع على الخريطة 📎 أو أرسل موقعك الحالي 📍_
ru: Какой город? _Введи название, выбери геопозицию на карте 📎 или отправь текущую 📍_

# Message.AskCity.ExternalError
source: ⌛ The external service didn't respond, please try again.
ar: ⌛ لم يستجب الخدمة الخارجية، يرجى المحاولة مرة أخرى.
ru: ⌛ Сторонний сервис не ответил, попробуй еще раз.

# Message.AskCity.InvalidCity
source: ❌🔍 City not found, please try again.
ar: ❌🔎 لم يتم العثور على المدينة، يرجى المحاولة مرة أخرى.
ru: ❌🔍 Город не найден, попробуй еще раз.

# Message.AskDescription.AskDescription
source: Add a profile description\. Continue to leave the field blank\. _The text can be formatted\._
ar: أضف وصفًا للملف الشخصي\. استمر لتترك هذا الحقل فارغًا\. _يمكن تنسيق النص\._
ru: Добавь описание анкеты\. Продолжи, чтобы оставить поле пустым\. _Текст можно форматировать\._

# Message.AskLanguage.AskLanguage
source: Which language do you prefer?
ar: ما هي اللغة التي تفضلها؟
ru: Какой язык предпочитаешь?

# Message.AskMedia.AskMedia
source: Choose what to upload: photos or a short video.
ar: اختر للتحميل: صور أو فيديو قصير.
ru: Выбери, что загрузить: фотографии или короткое видео.

# Message.AskName.AskName
source: What is your name?
ar: ما اسمك؟
ru: Как тебя зовут?

# Message.AskSex.AskSex
source: What is your gender?
ar: ما هو جنسك؟
ru: Какого ты пола?

# Message.AskSexFilter.AskSexFilter
source: Who are you looking for?
ar: مَن ستبحث عنه؟
ru: Кого будешь искать?

# Message.ChooseCity.ChooseCity
source: 🔍 Found {0}. Please select yours.
ar: 🔎 تم العثور على {0}. يرجى اختيار مدينتك.
ru: 🔍 Найдено {0}. Выбери свой.

# Message.ChoosePhoto.AskAddPhoto
source: Add more or proceed to the next step\.
ar: أضف صورة أخرى أو انتقل إلى الخطوة التالية\.
ru: Добавь еще фото или перейди к следующему шагу\.

# Message.ChoosePhoto.ChoosePhoto
source: Upload up to {0} photos one by one\. _Attach an image from the gallery, not a file\._
ar: أرسل حتى {0} صور واحدة تلو الأخرى\. _أرفق صورة من المعرض، لا ملف\._
ru: Пришли до {0} фото по очереди\. _Прикрепи изображение из галереи, не файл\._

# Message.ChoosePhoto.PhotoAdded
source: {0} out of {1} photos added.
ar: {0} من {1} صورة تم إضافتها.
ru: {0} из {1} фото добавлено.

# Message.ChooseVideo.ChooseVideo
source: Send a video from {0} to {1} seconds long\. _Attach a video from the gallery, not a file\._
ar: أرسل فيديو من {0} إلى {1} ثواني مدة\. _أرفق فيديو من المعرض، لا ملف\._
ru: Пришли видео от {0} до {1} секунд длительностью\. _Прикрепи видео из галереи, не файл\._

# Message.ChooseVideo.InvalidDuration
source: ⚠️ Video duration must be between {0} and {1} seconds.
ar: ⚠️ يجب أن تكون مدة الفيديو بين {0} و {1} ثواني.
ru: ⚠️ Длительность видео должна быть от {0} до {1} секунд.

# Message.DeleteProfile.DeleteProfile
source: 🚨 Please enter your profile name to confirm deletion\. This action cannot be undone\. __*{0}*__
ar: 🚨 الرجاء إدخال اسم ملفك الشخصي لتأكيد الحذف، لا يمكن التراجع عن هذا الإجراء\. __*{0}*__
ru: 🚨 Введи имя своего профиля чтобы подтвердить удаление\. Это действие необратимо\. __*{0}*__

# Message.Profile.Profile
source: You are in your profile.
ar: أنت في ملفك الشخصي.
ru: Ты в своем профиле.

# Message.Registration.PressToStart
source: Press {0} to start the bot 🤖
ar: اضغط {0} لبدء البوت 🤖
ru: Нажми {0} чтобы запустить бота 🤖

# Message.Shared.AgeValidation
source: ⚠️ The age can be between {0} and {1}.
ar: ⚠️ العمر يمكن أن يكون بين {0} و {1}.
ru: ⚠️ Возраст может быть от {0} до {1}.

# Message.Shared.BoostIncreased
source: 🚀 Boost increased\! *\({0}\/{1}\)* _Visit for {1} days in a row for maximum effect\._
ar: 🚀 تعزيز الدعم\! *\({0}\/{1}\)* _قم بالزيارة لمدة {1} أيام متتالية لتحقيق أقصى تأثير\._
ru: 🚀 Буст увеличен\! *\({0}\/{1}\)* _Заходи {1} дней подряд для максимального эффекта\._

# Message.Shared.BoostKeep
source: 🚀 Maximum boost\! *\({0}\/{0}\)* _Keep visiting to maintain the effect\._
ar: 🚀 التعزيز الأقصى\! *\({0}\/{0}\)* _استمر في الزيارة للحفاظ على التأثير\._
ru: 🚀 Максимальный буст\! *\({0}\/{0}\)* _Продолжай заходить, чтобы сохранить эффект\._

# Message.Shared.ChooseAction
source: Choose an action.
ar: اختر إجراءً.
ru: Выбери действие.

# Message.Shared.CityEntered
source: 🌍 Your city is set to __{0}__\.
ar: 🌍 __{0}__ تم تعيين مدينتك إلى\.
ru: 🌍 Установлен город __{0}__\.

# Message.Shared.InvalidLength
source: ⚠️ The length must be between {0} and {1} characters.
ar: ⚠️ يجب أن يكون الطول بين {0} و {1} حرفًا.
ru: ⚠️ Длина должна быть от {0} до {1} символов.

# Message.Shared.InvalidResolution
source: ⚠️ The minimum resolution is {0}x{0} pixels.
ar: ⚠️ الدقة الدنيا هي {0}✕{0} بكسل.
ru: ⚠️ Минимальное разрешение {0}x{0} пикселей.

# Message.Shared.LowWeight
source: 🕒 No activity for a long time\.
ar: 🕒 لا يوجد نشاط لفترة طويلة\.
ru: 🕒 Нет активности долгое время\.

# Message.Shared.LowWeightNoSub
source: _Profile will be excluded from search\._
ar: _سيتم استبعاد الملف الشخصي من البحث\._
ru: _Профиль будет исключен из поиска\._

# Message.Shared.LowWeightSub
source: _✨ Thanks to *Crush Premium*, your profile will not be excluded from search\._
ar: _✨ بفضل *Crush Premium*، لن يتم استبعاد ملفك الشخصي من البحث\._
ru: _✨ Благодаря *Crush Premium* профиль не будет исключен из поиска\._

# Message.Shared.Relevance
source: _Don\'t forget to visit: the more often you visit, the higher your profile\'s relevance\._
ar: _لا تنسى الزيارة: كلما زرت أكثر، كانت صلة ملفك الشخصي أعلى\._
ru: _Не забывай заходить: чем чаще ты заходишь, тем выше релевантность профиля\._

# Message.Shared.UnhandledError
source: 🛠️ Oops! Something went wrong. Please try again later.
ar: 🛠️ عذرًا! حدث خطأ ما. يرجى المحاولة مرة أخرى لاحقًا.
ru: 🛠️ Упс! Что-то пошло не так. Попробуй снова позже.

# Message.Subscription.Active
source: ✨ Thank you for subscribing *Crush Premium*\. Here's what is now unlocked:
ar: ✨ شكرًا لاشتراكك في *Crush Premium*\. إليك ما تم فتحه الآن:
ru: ✨ Спасибо за подписку на *Crush Premium*\. Теперь тебе доступны эксклюзивные функции:

# Message.Subscription.Features
source: • 💚 Unlimited likes • 📅 Extended age filter • 🚀 Maximum profile boost • 🕒 Profile stays in search • ✨ Exclusive emoji by your name • 📷 2 more profile photos • 🎬 x2 profile video length • ✏️ x2 profile description length
ar: • 💚 لايكات غير محدودة • 📅 فلتر العمر الموسع • 🚀 تعزيز الملف الشخصي الأقصى • 🕒 الملف الشخصي لا يختفي من البحث • ✨ إيموجي حصري بجانب اسمك • 📷 ٢ صورة إضافية للملف الشخصي • 🎬 ✕٢ طول الفيديو في الملف الشخصي • ✏️ ✕٢ طول وصف الملف الشخصي
ru: • 💚 Неограниченные лайки • 📅 Расширенный фильтр возраста • 🚀 Максимальный буст профиля • 🕒 Профиль не исчезает из поиска • ✨ Эксклюзивное эмодзи у имени • 📷 На 2 фото профиля больше • 🎬 x2 длина видео в профиле • ✏️ x2 длина описания профиля

# Message.Subscription.Inactive
source: ✨ Go beyond the limits and unlock exclusive features by subscribing *Crush Premium*:
ar: ✨ تخطى الحدود وافتح ميزات حصرية بالاشتراك في *Crush Premium*:
ru: ✨ Сними лимиты и разблокируй эксклюзивные функции с *Crush Premium*:

# Message.Subscription.Management
source: _*[Subscription management]({0})*_
ar: _*[إدارة الاشتراك]({0})*_
ru: _*[Управление подпиской]({0})*_

# Message.Subscription.Subscribe
source: 🎉 Enjoy a *{0}%* discount on your first year's purchase\.
ar: 🎉 استمتع بخصم *{0}٪* على أول عملية شراء لك في السنة\.
ru: 🎉 Получи *{0}%* скидки при первой покупке на год\.

# Message.ViewProfile.AgeFilterReset
source: 📅🔄 Age filter temporarily reset.
ar: 📅🔄 تم إعادة تعيين فلتر العمر مؤقتًا.
ru: 📅🔄 Фильтр возраста временно сброшен.

# Message.ViewProfile.NewLike
source: 💚 New like\! *\({0}\)*
ar: 💚 إعجاب جديد\! *\({0}\)*
ru: 💚 Новая симпатия\! *\({0}\)*

# Message.ViewProfile.NewMatch
source: 🎉 New match\! *\({0}\)*
ru: 🎉 Взаимная симпатия\! *\({0}\)*

# Message.ViewProfile.NoProfiles
source: No new profiles available. Share the bot with your friends!
ar: لا توجد ملفات شخصية جديدة. شارك البوت مع أصدقائك!
ru: Новых профилей нет. Поделись ботом с друзьями!

# Message.ViewProfile.PressAny
source: _Press any button to view\._
ar: _اضغط على أي زر للمشاهدة\._
ru: _Нажми любую кнопку чтобы посмотреть\._

# Message.ViewProfile.Proceed
source: _Finish with the current profile\._
ar: _انته من الملف الشخصي الحالي\._
ru: _Закончи с текущим профилем\._

# Message.ViewProfile.StartSearch
source: _Start search to view 🔍_
ar: _ابدأ البحث للمشاهدة 🔎_
ru: _Начни поиск, чтобы посмотреть 🔍_

# Message.ViewProfile.StatusLiked
source: _Liked you\!_ 💚
ar: _أُعجب بك\!_ 💚
ru: _Симпатия к тебе\!_ 💚

# Message.ViewProfile.StatusMatched
source: _This is a match\!_ 🎉 {0}
ar: _تطابقتما\!_ 🎉 {0}
ru: _Взаимная симпатия\!_ 🎉 {0}
